{
  "vocab_size": 256206,
  "max_position_embeddings": 1024,
  "d_model": 1024,
  "encoder_ffn_dim": 8192,
  "encoder_layers": 24,
  "encoder_attention_heads": 16,
  "decoder_ffn_dim": 8192,
  "decoder_layers": 24,
  "decoder_attention_heads": 16,
  "dropout": 0.1,
  "attention_dropout": 0.1,
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "init_std": 0.02,
  "encoder_layerdrop": 0,
  "decoder_layerdrop": 0,
  "use_cache": true,
  "num_hidden_layers": 24,
  "scale_embedding": true,
  "return_dict": true,
  "output_hidden_states": false,
  "output_attentions": false,
  "torchscript": false,
  "torch_dtype": "float32",
  "use_bfloat16": false,
  "tf_legacy_loss": false,
  "pruned_heads": {},
  "tie_word_embeddings": true,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": true,
  "is_decoder": false,
  "cross_attention_hidden_size": null,
  "add_cross_attention": false,
  "tie_encoder_decoder": false,
  "max_length": 200,
  "min_length": 0,
  "do_sample": false,
  "early_stopping": false,
  "num_beams": 1,
  "num_beam_groups": 1,
  "diversity_penalty": 0.0,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "typical_p": 1.0,
  "repetition_penalty": 1.0,
  "length_penalty": 1.0,
  "no_repeat_ngram_size": 0,
  "encoder_no_repeat_ngram_size": 0,
  "bad_words_ids": null,
  "num_return_sequences": 1,
  "output_scores": false,
  "return_dict_in_generate": false,
  "forced_bos_token_id": null,
  "forced_eos_token_id": null,
  "remove_invalid_values": false,
  "exponential_decay_length_penalty": null,
  "suppress_tokens": null,
  "begin_suppress_tokens": null,
  "architectures": [
    "M2M100ForConditionalGeneration"
  ],
  "finetuning_task": null,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "tokenizer_class": null,
  "prefix": null,
  "bos_token_id": 0,
  "pad_token_id": 1,
  "eos_token_id": 2,
  "sep_token_id": null,
  "decoder_start_token_id": 2,
  "task_specific_params": null,
  "problem_type": null,
  "_name_or_path": "F:/03MODELS/NLLB-200-1.3B",
  "transformers_version": "4.39.3",
  "model_type": "m2m_100"
}